; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p2---int100n150-m25---int100c110---s19---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level7 level7)
(sum level0 level12 level12)
(sum level0 level14 level14)
(sum level0 level17 level17)
(sum level0 level19 level19)
(sum level0 level25 level25)
(sum level1 level3 level4)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level7 level8)
(sum level1 level12 level13)
(sum level1 level14 level15)
(sum level1 level17 level18)
(sum level1 level19 level20)
(sum level1 level25 level26)
(sum level2 level3 level5)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level7 level9)
(sum level2 level12 level14)
(sum level2 level14 level16)
(sum level2 level17 level19)
(sum level2 level19 level21)
(sum level2 level25 level27)
(sum level3 level3 level6)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level7 level10)
(sum level3 level12 level15)
(sum level3 level14 level17)
(sum level3 level17 level20)
(sum level3 level19 level22)
(sum level3 level25 level28)
(sum level4 level3 level7)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level7 level11)
(sum level4 level12 level16)
(sum level4 level14 level18)
(sum level4 level17 level21)
(sum level4 level19 level23)
(sum level4 level25 level29)
(sum level5 level3 level8)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level7 level12)
(sum level5 level12 level17)
(sum level5 level14 level19)
(sum level5 level17 level22)
(sum level5 level19 level24)
(sum level5 level25 level30)
(sum level6 level3 level9)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level7 level13)
(sum level6 level12 level18)
(sum level6 level14 level20)
(sum level6 level17 level23)
(sum level6 level19 level25)
(sum level6 level25 level31)
(sum level7 level3 level10)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level7 level14)
(sum level7 level12 level19)
(sum level7 level14 level21)
(sum level7 level17 level24)
(sum level7 level19 level26)
(sum level7 level25 level32)
(sum level8 level3 level11)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level7 level15)
(sum level8 level12 level20)
(sum level8 level14 level22)
(sum level8 level17 level25)
(sum level8 level19 level27)
(sum level8 level25 level33)
(sum level9 level3 level12)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level7 level16)
(sum level9 level12 level21)
(sum level9 level14 level23)
(sum level9 level17 level26)
(sum level9 level19 level28)
(sum level10 level3 level13)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level7 level17)
(sum level10 level12 level22)
(sum level10 level14 level24)
(sum level10 level17 level27)
(sum level10 level19 level29)
(sum level11 level3 level14)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level7 level18)
(sum level11 level12 level23)
(sum level11 level14 level25)
(sum level11 level17 level28)
(sum level11 level19 level30)
(sum level12 level3 level15)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level7 level19)
(sum level12 level12 level24)
(sum level12 level14 level26)
(sum level12 level17 level29)
(sum level12 level19 level31)
(sum level13 level3 level16)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level7 level20)
(sum level13 level12 level25)
(sum level13 level14 level27)
(sum level13 level17 level30)
(sum level13 level19 level32)
(sum level14 level3 level17)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level7 level21)
(sum level14 level12 level26)
(sum level14 level14 level28)
(sum level14 level17 level31)
(sum level14 level19 level33)
(sum level15 level3 level18)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level7 level22)
(sum level15 level12 level27)
(sum level15 level14 level29)
(sum level15 level17 level32)
(sum level16 level3 level19)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level7 level23)
(sum level16 level12 level28)
(sum level16 level14 level30)
(sum level16 level17 level33)
(sum level17 level3 level20)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level7 level24)
(sum level17 level12 level29)
(sum level17 level14 level31)
(sum level18 level3 level21)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level7 level25)
(sum level18 level12 level30)
(sum level18 level14 level32)
(sum level19 level3 level22)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level7 level26)
(sum level19 level12 level31)
(sum level19 level14 level33)
(sum level20 level3 level23)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level7 level27)
(sum level20 level12 level32)
(sum level21 level3 level24)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level7 level28)
(sum level21 level12 level33)
(sum level22 level3 level25)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level7 level29)
(sum level23 level3 level26)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level7 level30)
(sum level24 level3 level27)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level7 level31)
(sum level25 level3 level28)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level7 level32)
(sum level26 level3 level29)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level7 level33)
(sum level27 level3 level30)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level28 level3 level31)
(sum level28 level5 level33)
(sum level29 level3 level32)
(sum level30 level3 level33)

(connected l0 l1)
(fuelcost level5 l0 l1)
(connected l0 l2)
(fuelcost level19 l0 l2)
(connected l0 l5)
(fuelcost level17 l0 l5)
(connected l1 l0)
(fuelcost level5 l1 l0)
(connected l1 l4)
(fuelcost level14 l1 l4)
(connected l2 l0)
(fuelcost level19 l2 l0)
(connected l2 l3)
(fuelcost level7 l2 l3)
(connected l2 l4)
(fuelcost level6 l2 l4)
(connected l2 l5)
(fuelcost level12 l2 l5)
(connected l3 l2)
(fuelcost level7 l3 l2)
(connected l3 l4)
(fuelcost level25 l3 l4)
(connected l3 l5)
(fuelcost level3 l3 l5)
(connected l4 l1)
(fuelcost level14 l4 l1)
(connected l4 l2)
(fuelcost level6 l4 l2)
(connected l4 l3)
(fuelcost level25 l4 l3)
(connected l5 l0)
(fuelcost level17 l5 l0)
(connected l5 l2)
(fuelcost level12 l5 l2)
(connected l5 l3)
(fuelcost level3 l5 l3)

(at t0 l1)
(fuel t0 level33)
(= (total-cost) 0)

(at p0 l1)
(at p1 l0)
)

(:goal
(and
(at p0 l4)
(at p1 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 0 of 2
2. (drive t0 l1 l0 level28 level5 level33)
   deleted: (at t0 l1) (fuel t0 level33)
   added: (at t0 l0) (fuel t0 level28)
   goals met: 0 of 2
3. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 2
4. (drive t0 l0 l2 level9 level19 level28)
   deleted: (at t0 l0) (fuel t0 level28)
   added: (at t0 l2) (fuel t0 level9)
   goals met: 0 of 2
5. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 1 of 2
6. (drive t0 l2 l4 level3 level6 level9)
   deleted: (at t0 l2) (fuel t0 level9)
   added: (at t0 l4) (fuel t0 level3)
   goals met: 1 of 2
7. (unload p0 t0 l4)
   deleted: (in p0 t0)
   added: (at p0 l4)
   goals met: 2 of 2
